/**=================================================================================================
 * @file	test6.39.cpp.
 *
 * Implements the test 6.39 class
 * 练习 6.39: 说明在下面的每组声明中第二条声明语句是何含义。 如果有非法的声明， 请指出来。
 * (a) int calc(int, int);
 * int calc(const int, const int);
 * (b) int get();
 * double get();
 * (c) int *reset(int *);
 * double *reset(double *);
 *  
 *  (a)：错误，只是重复生命了
 *  (b)：错误
 *  (c)：正确
 *===============================================================================================**/
