/**=================================================================================================
 * @file	test5.14.cpp.
 *
 * Implements the test 5.14 class
 * 练习 5.14： 编写一段程序， 从标准输入中读取若干 string 对象并查找连续重复出现的单词。 
 * 所谓连续重复出现的意思是： 一个单词后面紧跟着这个单词本身。 耍求记录连续重复出现的最大次数以及对应的单词。 
 * 如果这样的单词存在， 输出重S出现的最大次数;如果不存在， 输出一条信息说明仟何单词都没有连续出现过。 
 * 例如， 如果输入是how now now now brown cow cow
 * 那么输出应该表明单词 now 连续出现了 3 次。
 *===============================================================================================**/
