/**=================================================================================================
 * @file	test5.15.cpp.
 *
 * Implements the test 5.15 class
 * 练习 5.15: 说明下列循环的含义并改正其中的错误。
 * (a)for (int ix = 0; ix != sz; ++ix) { /... / }
 * if (ix != sz)
 * // ...
 * 错误：sz这个变量定义在外部，是否是int类型的就不好说。
 *            ix != sz这个条件为真，在循环里面就已经保证了。
 * (b)int ix;
 * for (ix != sz; ++ix) { /.../ }
 * 错误：循环语句可以为空，但是用分号表示，循环条件不完整，少一个分号
 * (c)for (int ix = 0; ix != sz; ++ix, ++ sz) { /..../ }
 * 错误：2个变量同时增加，这个条件用不可能完成。人工写的循环，2个分号中间的部分，必须要在某个时刻产生失败的情况以终止循环。
 *===============================================================================================**/
