/**=================================================================================================
 * @file	test6.40.cpp.
 *
 * Implements the test 6.40 class
 * 练习 6.40: 下面的哪个声明是错误的？ 为什么？
 * (a)int ff(int a, int b = 0, int c = 0);
 * (b)char *init(int ht = 24, int wd, char bckgrnd);
 *  
 *  在上面的两个声明中， （a)是正确的而(b)是错误的。 它们都用到了默认实参， 但是C++规定一旦某个形参被赋予了默认实参， 
 *  则它后面的所有形参都必须有默认实参。这一规定是为了防范可能出现的二义性， 显然(b)违反了这一规定。
 *===============================================================================================**/
