/**=================================================================================================
 * @file	test2.16.cpp.
 *
 * Implements the test 2.16 class
 * 练习 2.16: 考察下面的所有赋值然后回答: 哪些赋值是不合法的? 为什么? 哪些赋值是合法的？ 它们执行了什么样的操作？
 * int i=0, &r1=i;            double d =0,&r2=d;
 * (a)r2 = 3.14159;  合法，与r2绑定的对象，赋值成3.14159
 * (b)r2 = r1;非法，r1 r2是不同类型的引用
 * (c) i=r2;非法，i r2是不同类型
 * (d)r1 = d; 非法，d r1是不同类型
 *===============================================================================================**/
