/**=================================================================================================
 * @file	test3.13.cpp.
 *
 * Implements the test 3.13 class
 * 练习 3.13: 下列的 vector 对象各包含多少个元素？ 这些元素的值分别是多少？
 * (a) vector<int> vl;
 * (b)vector<int> v2(10);
 * (c) vector<int> v3(10, 42);
 * (d)vector<int> v4{10};
 * (e) vector<int> v5{10, 42};
 * (f)vector<string> v6{10};
 * (g) vector<string> v7{10, "hi"};
 *===============================================================================================**/
