/**=================================================================================================
 * @file	test12.17.cpp.
 *
 * Implements the test 12.17 class
 * 练习 12.17： 下面的 unique_ptr 声明中， 哪些是合法的， 哪些可能导致后续的程序错误？ 解释每个错误的问题在哪里。
 * int ix=1024 , *pi = &ix, *pi2 = int(2048);
 * typedef unique_ptr<int> IntP;
 * (a) IntP p0(ix);
 * (b) 工ntP pi(pi);
 * (c) IntP p2(pi2);
 * (d) IntP p3(&ix);
 * (e) IntP p4(new int(2048));
 * (f) IntP p5(p2.get());
 *===============================================================================================**/
