/**=================================================================================================
 * @file	test10.7.cpp.
 *
 * Implements the test 10.7 class
 * 练习 10.7: 下面程序是否有错误？ 如果有， 请改正。
 * (a) vector<int> vec; list<int> 1st; int i;
 * while (cin >> i)
 * 1st.push_back(i);
 * copy(1st.cbegin(), 1st.cend(), vec.begin());
 * (b) vector<int> vec;
 * vec.reserve(10 )； //reverse 将在 9.4 节（ 第 318 页 ） 介绍
 * fill_n(vec.begin(), 10, 0);
 * 练习 10.8: 本节提到过， 标准库算法不会改变它们所操作的容器的大小。 为什么使用back_inserter 不会使这一断言失效？
 *===============================================================================================**/
