/**=================================================================================================
 * @file	test2.5.cpp.
 *
 * Implements the test 2.5 class
 * 练习2.5：指出下述字面值的数据类型并说明每一组内几种字面值的区别:
 * (a) 'a', L'a',"a",L"a"  字符a ;宽字符a,字符串a,宽字符字符串a
 * (b)10, 10u, 10L, 10uL, 012, OxC  十进制10，unsigned10，unsigned long10，八进制12，十六进制C
 * (c) 3.14, 3.14f, 3.14L  浮点型3.14，float3.14，long3.14
 * (d)10, 10u, 10., 10e-2 十进制10，unsigned10，long double 10，float单精度浮点型10e-2
 * 练习2.6：下面两组定义是否有区別， 如果有， 请叙述之:
 * int month = 9, day = 7;   定义10进制
 * int month = 09, day = 07;   定义8进制
 * 练习2.7：下述字面值表示何种含义？ 它们各自的数据类型是什么？
 * (a)"Who goes with F\145rgus?\012"   字符串
 * (b)3.14elL   long long e的3.14次方。（浮点型字面值表现为一个小数或以科学计数法表示的指数， 其中指数部分用 E 或 e 标识）
 * (c)1024f  float1024
 * (d)3.14L  long3.14
 *===============================================================================================**/

