/**=================================================================================================
 * @file	test2.27.cpp.
 *
 * Implements the test 2.27 class
 * 练习 2.27: 下面的哪些初始化是合法的？ 请说明原因。
 * (a)int i = -1, &r = 0;  //&r = 0 非法
 * (b)int *const p2 = &i2; //合法  前提i2是一个int型的对象
 * (c)const int i = -1, &r=0；//  &r=0 非法
 * (d)const int *const p3 = &i2;//合法 P3将一直指向 &i2这个地址  不太清楚？
 * (e)const int *p1 = &i2; //合法 P1将一直指向 &i2这个地址
 * (f)const int &const r2; // 非法，定义引用但未初始化
 * (g)const int i2 = i, & r = i;//合法吧
 *===============================================================================================**/
