/**=================================================================================================
 * @file	test6.24.cpp.
 *
 * Implements the test 6.24 class
 * 练习 6.24: 描述下面这个函数的行为。 如果代码中存在问题， 请指出并改正。
 * void print(const int ia[10]){
 * for (size_t i = 0; i != 10; ++i)
 * cout << ia[i] << endl;}
 *  
 *  此题明显以传值的方式传递数组，是错误的。如果想传递一个大小为10的数组，可以用以下方法：
 *  用指针的方式来传数组：
 *  void My_print(const int (&ia)[10]) 
 *===============================================================================================**/
