/**=================================================================================================
 * @file	test2.29.cpp.
 *
 * Implements the test 2.29 class
 * 练习 2.29: 假设已有上一个练习中定义的那些变量， 则下面的哪些语句是合法的？ 请说明原因。
 * (a)i= ic;//合法，常量赋值给变量是可以的
 * (b)p1=p3; //合法，同类型常量赋值给变量
 * (c)p1 = &ic;//不可以，ic是常量，赋值给变量后便可以通过p1引用来修改常量，本身是不合法的。
 * (d)p3 = &ic;//合法，常量地址赋值给常量指针。
 * (e)p2 = p1;//合法，初始化可以通过表达式，赋值等方式获取。
 * (f) ic = *p3；//P3不为空时合法
 *===============================================================================================**/
