/**=================================================================================================
 * @file	test2.1.cpp.
 * 变量和基本类型
 * Implements the test 2.1 class
 * 类型int ,long ,longlong,和short的区别是什么？
 * 长度从小到大分别为16位，32位，64位。分为短整形，整形和长整型。
 * 一个int至少和一个short一样大，一个long至少和一个Int一样大。
 * 无符号类型和带符号类型的区别是什么？
 * 带符号类型可以表示大于0，0，小于0。无符号类型仅能够表示大于0的数字。
 * float和double的区别是什么？
 * float用1个字表示，有7个有效位。double用2个字表示，有16个有效位。
 * 对于利率，本金，利率分别选择何种数据类型？说明理由。
 * 本金使用float，处理圆角分；利率使用double,充分精确小数点后若干位；利率使用float，处理百分数后3位就差不多了。
 *===============================================================================================**/
