/**=================================================================================================
 * @file	test5.16.cpp.
 *
 * Implements the test 5.16 class
 * 练习 5.16： while 循环特别适用于那种条件保持不变、 反复执行操作的情况， 例如，当未达到文件末尾时不断读取下一个值。 
 * for 循环则更像是在按步骤迭代， 它的索引值在某个范围内依次变化。 
 * 根据每种循环的习惯用法各自编写一段程序， 然后分別用另一种循环改写。 如果只能使用一种循环， 你倾向于使用哪种呢？ 为什么？
 * 
 * 2种循环之前都有练过
 * 更加倾向于，for循环，因为也可以写成根据条件判断是否结束循环的方式，不一定固定次数。
 *===============================================================================================**/
