/**=================================================================================================
 * @file	test2.18.cpp.
 *
 * Implements the test 2.18 class
 * 练习 2.18： 编写代码分别更改指针的值以及指针所指对象的值。
 *===============================================================================================**/
#include<iostream>
int main() {
	int i = 0, j = 10;//定义整形变量
	int *p = &i;//定义整形指针，初始化为i
	std::cout << i << *p << std::endl;//直接输出i和通过地址输出i
	p = &j;
	std::cout << *p << std::endl;//更改指针的地址
	*p = 12;
	std::cout << *p << std::endl;//通过更改指针来修改值

}