/**=================================================================================================
 * @file	test4.8.cpp.
 *
 * Implements the test 4.8 class
 * 练习 4.8: 说明在逻辑与、 逻辑或及相等性运算符中运算对象求值的顺序。
 * 1、逻辑与运算符和逻辑或运算符都是先求左侧运算对象的值再求右侧运算对象的值， 当且仅当左侧运算对象无法确定表达式的结果时才会计算右侧运算对象的值。 
 * 这种策略称为短路求值 （ short-circuit evaluation )。
 * 对于逻辑与运算符来说，当且仅当左侧运算对象为](? .时才对右侧运算对象求值。
 * 对于逻辑或运算符来说，当且仅当左侧运算对象为假时才对右侧运算对象求值。
 *===============================================================================================**/
