/**=================================================================================================
 * @file	test3.27.cpp.
 *
 * Implements the test 3.27 class
 * 练习 3.27： 假设 txt_size 是一个无参数的函数， 它的返冋值是int 请冋答下列哪个定义是非法的？为什么？
 * unsigned buf_size = 1024;  
 * (a)int ia[buf_size];  //错误： cnt 不是常量表达式
 * (b)int ia[4 7-14];//错误，要用花括号
 * (c)int ia[txt_size()];//错误 ，txt_size是函数
 * (d)char st[11] =“fundamental” ； //错误： 没有空间可存放空字符！
 *===============================================================================================**/
