/**=================================================================================================
 * @file	test12.12.cpp.
 *
 * Implements the test 12.12 class
 * 练习 12.12： p 和 q 的定义如下， 对于接下来的对 process 的每个调用， 如果合法,解释它做了什么， 如果不合法， 解释错误原因：
 * auto p = new int();
 * auto sp = make_shared<int>();
 * (a) process(sp);
 * (b) process(new int ()) ;
 * (c) process(p);
 * (d) process(shared_ptr<int>(p));
 *===============================================================================================**/
