/**=================================================================================================
 * @file	test2.28.cpp.
 *
 * Implements the test 2.28 class
 * 练习 2.28: 说明下面的这些定义是什么意思， 挑出其中不合法的。
 * (a)int i, *const  cp;//非法，常量指针定义但未初始化
 * (b)int *pl, *const p2;//非法，p2定义但为初始化
 * (c)const int ic, &r=ic;//非法，ic定义但是未初始化
 * (d)const int *const p3;//非法，p3整形常量指针定义但未初始化
 * (e)const int *p;//非法，定义未初始化，没有意义
 *===============================================================================================**/
