/**=================================================================================================
 * @file	test6.41.cpp.
 *
 * Implements the test 6.41 class
 * 练习 6.41： 下面的哪个调用是非法的？ 为什么？ 哪个调用虽然合法但显然与程序员的初衷不符？ 为什么？
 * char *init(int ht, int wd = 80, char bckgrnd = ' ' ）
 * (a)init(); 
 * (b)init(24,10); 
 * (c)init(14, '*' );
 *  
 *  (a)是非法的， 3个 形参中第一个是非默认的，要传值才能调用。
 *  (b)是合法的。
 *  (c)编译非法，逻辑合法。’*‘是被强制转化为int类型后传给第二个参数的，正常不会这么用。
 *===============================================================================================**/
