/**=================================================================================================
 * @file	test2.8.cpp.
 *
 * Implements the test 2.8 class
 * 利用转义序列编译一段程序，要求先输出2M，然后转到新的一行，修改程序，使其先输出2，再输出制表符，再输出M，再换行
 *===============================================================================================**/
#include<iostream>
int main() {
	std::cout << "修改前" << std::endl;
	std::cout << "2M" << std::endl;
	std::cout << "修改后" << std::endl;
	std::cout << "2" ;
	std::cout << '\t' ;//横向制表符
	std::cout << '\115' << '\n' ;//输出M然后换一行|12也是换行符

}