/**=================================================================================================
 * @file	test2.8.cpp.
 *
 * Implements the test 2.8 class
 * 请利用转义序列编写一段程序， 要求先输出 2M, 然后转到新一行。 修改程序
 * 使其先输出 2 , 然后输出制表符， 再输出 M, 最后转到新一行。
 *===============================================================================================**/
#include<iostream>
int main() {
	std::cout << "修改前" << std::endl;
	std::cout << "2M" << std::endl;
	std::cout << "修改后" << std::endl;
	std::cout << "2" ;
	std::cout << '\t' ;    //横向制表符
	std::cout << '\115' << '\n' ;    //输出M然后换一行|12也是换行符
}